constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          620;
        startFace       188215;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1096;
        startFace       188835;
    }
    frame
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2418;
        startFace       189931;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8872;
        startFace       192349;
    }
)

// ************************************************************************* //
