system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
        nNonOrthogonalCorrectors 0;
        nCorrectors          1;
	nOuterCorrectors    50;
		     
	residualControl
	{
	    U
            {
	 	    tolerance  1e-5;
        	    relTol      0;
            }
            p
            {
		    tolerance  5e-4;
                    relTol      0;
	    }
	}
}
 
relaxationFactors
{
	    fields
            {
  	            p      0.3;
	            pFinal   1;
	    }
            equations
	    {
            "U|k|epsilon"     0.3;
            "(U|k|epsilon)Final"   1;
      }
}

//{
//    nNonOrthogonalCorrectors 0;
//    nCorrectors         2;
//}


// ************************************************************************* //
